tutorials/consistentSolvers/airfoil/alpha25/consistentPimpleFoam_initRun/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     consistentPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          1e-3;

writeControl    runTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression compressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

maxCo           10; //change

adjustTimeStep  no; //change

functions //To extract the coefficients during the simulation
{
    forceCoeffs
    {
        type forceCoeffs;
        functionObjectLibs ("libforces.so");
        patches ("top.*|bottom.*");
        log true
        pName p;          //pressure
        Uname U;          //velocity
        rhoName rhoInf;   //reference density name
        rhoInf 1.225;      //reference density value
        magUInf 12.9;   //reference velocity
        CofR (0 0 0.5);   //Centre of rotation
        liftDir (0 1 0);   //Direction of the lift coefficient
        dragDir (1 0 0);   //Direction of the drag coefficient
        pitchAxis (0 0 -1); //Pitching moment axis
        lRef 1;
        Aref 0.3;

        outputControl   timeStep;
        outputInterval 1;
    }
}

// ************************************************************************* //
