tutorials/consistentSolvers/airfoil/alpha25/consistentPimpleFoam_initRun/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh      solidBodyMotionFvMesh;

solidBodyMotionFvMeshCoeffs
{
	solidBodyMotionFunction twodRigidBody;

	twodRigidBodyCoeffs
	{
		rotationAmplitude	44;//Rotation angle [deg]
		rotationFrequency	1.26;//Frequency for rotation [Hz]
		rotationOrigin		(0 0 0.5);//Rotational origin
		translationAmplitude 0;//Translation amplitude [m]
		translationFrequency 0;//Translation frequency [Hz]
		translationDirection (0 1 0);//Translation direction [-]
	}
}

// ************************************************************************* //
